puts '                                             irb'

# irb (interactive ruby) - REPL-программа(read (R)(прочитать), evaluate (E)(выполнить), print (P), (loop - L))
# irb(в консоли) - интерпритатор Руби сразу в консоли. Завершить работу в irb можно в любой момент нажав ctrl+c

# С:\Projects\MyApp1>irb      (нажимаем enter)
# irb(main):001:0> 2+2*2
# => 6                        (интерпритатор возвращает(=>) нам результат действия)
# irb(main):002:0> puts 2+2*2
# 6                           (puts(ничего не считает только выводит) выводит результат действия)
# => nil                      (а интерпритатор возвращает уже nil)
# irb(main):003:0> exit       (exit команда выхода из irb  интерпритатора Руби)

# http://pry.github.io/  -  альтернатива irb
