puts '                                              Объекты'

# объекты/экземпляры класса(instance)
# heap(куча) memory - название оперативной памяти в программировании
# объект - это определенная часть(участок) занятой оперативной памяти, которая "принадлежит" какому то фрагмету кода, существующий во время работы программы
# повторение фрагмента кода(например переменной) в программе(например циклом) создает отдельный объект для каждого повторения в отдельном участке операивной памяти
# Важно отметить, что переменная не “содержит” сам объект, это просто ссылка на область памяти где на самом деле этот объект хранится. Мы можем иметь любое количество переменных, указывающих на один и тот же объект.











#
