# язык руби написан на языке Си

# программы, написанные на руби, не компилируются, а интерпретируются: мы ведь запускаем программы с помощью команды ruby app.rb, а не просто ./app

# такого понятия как «сборка» (build) в руби не существует. Однако, по привычке многие программисты называют «билдом» успешный запуск всех тестов очередной версии Руби

# • nightly build
# • preview
# • alpha
# • beta
# • stable
# • LTS (long-term support), не совсем билд, а более как тэг определенной
# версии

# «ночные сборки» (nightly builds). Смысл в том, что все изменения, которые произошли за последний день собираются в одну ветку и в автоматическом режиме компилируются

# preview-сборка, которая отличается от ночной тем, что она немного стабильнее

# «стабильная» (stable) сборка
















#
