puts '                                         Jekyll'

# https://github.com/jekyll/jekyll

# https://jekyllrb.com/docs/installation/       - доки, установка

# Jekyll — это Ruby Gem, который можно установить на большинстве систем.

# Jekyll — это простой, поддерживающий блоги, генератор статических сайтов(например лендинги, магазины "под ключ"), подходящий для личных, проектных или корпоративных сайтов. Думайте о нем как о файловой CMS, без всей сложности. Jekyll берет ваш контент, отображает шаблоны Markdown и Liquid и выдает полный статический веб-сайт, готовый к обслуживанию Apache, Nginx или другим веб-сервером.

# Jekyll — это движок, лежащий в основе GitHub Pages, который вы можете использовать для размещения сайтов прямо из своих репозиториев GitHub

# Jekyll делает только то, что вы ему говорите. Он не пытается перехитрить пользователей, делая смелые предположения, и не обременяет их ненужной сложностью и конфигурацией.


# Есть много средств оплаты, что интегрируются в статические сайты и позволяют и оплатить и даже вернуть ответ после оплаты
# Данные можно хранить например в гугл таблицах
# Придется добавить немного своего CSS и JS, чтобы получился норм проект



# выбирай jekyll) и с гитхабом соединись. Будешь посты через markdown писать и в гитхабе оставлять, на сайте будет показываться
# вот, например, другу пилит сайт где-то весной...
# https://github.com/Tonetfal/tonetfal.github.io/blob/master/_posts/2024-01-16-AI-Development-Using-UE5FSM.md
# и как на сайте выглядит
# https://tonetfal.github.io/posts/2024/01/AI%20development%20using%20UE5FSM/
















#
