

# 12m_R_filters_consern
#   before_action
#   concern. Обработка ошибок в контроллере

# 13_Rails_Helpers
#   Назначение вспомогательных методов контроллера хэлперами
#   Кастомный хэлпер для вывода названия страницы во вкладке
#   Кастомные хэлперы для динамического меню, переданного через yield

# 14_Rails_OneToMany
#   Методы up и down (добавление foreign_key в существующие таблицы, изменение значений по умолчанию в существующих колонках/строках)
#   Привязка к сущности при ее создании у которой уже есть привязка(белонгс ту)
#   Дополнительно(не относится к основной теме) вынесем повторяющийся код из экшенов контроллеров вопросов и ответов в отдельный метод нового консерна
#   Отображение аватаров юзера при помощи Gravatar
#   callbacks(функции обратного вызова)

# 15_Rails_Polym_assoc
#   concern для модели и маршрутов
#   модуль бутстрапа collapse для выпадающих форм
#   decorates_association

# 15т_R_ManyToMany
#   Метод класса модели с синтаксисом scope :all_by_tags, ->(tags) do .. end
#   TomSelect, ajax и поиск
#   парсинг json(serialize) blueprinter, рендер json

# 16_Rails_Scaffolding
#   Некоторые методы AR




















#
