puts '                                              Hotwire'

# https://hotwired.dev/

# Hotwire - фрэймворк, состоящий из комбинации фрэймворков Turbo и Stimulus(для фронтэнд)


puts
puts '                                               Turbo'

# https://turbo.hotwired.dev/

# Turbo - фрэймворк, являеющийся частью фрэймворка Hotwire. Появился как продолжение идеи turbolinks, но намного более мощный и он позволяет ускорять работу приложения, тк позволяет разбивать веб-страницы на отдельные независимые контексты и обновлять/перерисовывать необходимые части веб страниц, не перерисовывая всю страницу.
